{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v3.4.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "convolutional_Bidrectional_LSTM",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                3,
                48,
                48,
                1
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "time_distributed_input"
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed",
              "trainable": true,
              "batch_input_shape": [
                null,
                3,
                48,
                48,
                1
              ],
              "dtype": "float32",
              "layer": {
                "class_name": "Functional",
                "config": {
                  "name": "model",
                  "layers": [
                    {
                      "class_name": "InputLayer",
                      "config": {
                        "batch_input_shape": [
                          null,
                          48,
                          48,
                          1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_1"
                      },
                      "name": "input_1",
                      "inbound_nodes": []
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 16,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "class_name": "GlorotUniform",
                          "config": {
                            "seed": null
                          }
                        },
                        "bias_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "kernel_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "name": "conv2d",
                      "inbound_nodes": [
                        [
                          [
                            "input_1",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "batch_normalization",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                          3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "gamma_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "moving_mean_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "moving_variance_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "beta_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "gamma_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "beta_constraint": null,
                        "gamma_constraint": null
                      },
                      "name": "batch_normalization",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Activation",
                      "config": {
                        "name": "activation",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "elu"
                      },
                      "name": "activation",
                      "inbound_nodes": [
                        [
                          [
                            "batch_normalization",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 8,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "class_name": "GlorotUniform",
                          "config": {
                            "seed": null
                          }
                        },
                        "bias_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "kernel_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "name": "conv2d_1",
                      "inbound_nodes": [
                        [
                          [
                            "activation",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Dropout",
                      "config": {
                        "name": "dropout",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                      },
                      "name": "dropout",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d_1",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Concatenate",
                      "config": {
                        "name": "concatenate",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": -1
                      },
                      "name": "concatenate",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "batch_normalization_1",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                          3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "gamma_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "moving_mean_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "moving_variance_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "beta_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "gamma_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "beta_constraint": null,
                        "gamma_constraint": null
                      },
                      "name": "batch_normalization_1",
                      "inbound_nodes": [
                        [
                          [
                            "concatenate",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Activation",
                      "config": {
                        "name": "activation_1",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "elu"
                      },
                      "name": "activation_1",
                      "inbound_nodes": [
                        [
                          [
                            "batch_normalization_1",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d_2",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 8,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "class_name": "GlorotUniform",
                          "config": {
                            "seed": null
                          }
                        },
                        "bias_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "kernel_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "name": "conv2d_2",
                      "inbound_nodes": [
                        [
                          [
                            "activation_1",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Dropout",
                      "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                      },
                      "name": "dropout_1",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d_2",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Concatenate",
                      "config": {
                        "name": "concatenate_1",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": -1
                      },
                      "name": "concatenate_1",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_1",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "batch_normalization_2",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                          3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "gamma_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "moving_mean_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "moving_variance_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "beta_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "gamma_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "beta_constraint": null,
                        "gamma_constraint": null
                      },
                      "name": "batch_normalization_2",
                      "inbound_nodes": [
                        [
                          [
                            "concatenate_1",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Activation",
                      "config": {
                        "name": "activation_2",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "elu"
                      },
                      "name": "activation_2",
                      "inbound_nodes": [
                        [
                          [
                            "batch_normalization_2",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d_3",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 8,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "class_name": "GlorotUniform",
                          "config": {
                            "seed": null
                          }
                        },
                        "bias_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "kernel_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "name": "conv2d_3",
                      "inbound_nodes": [
                        [
                          [
                            "activation_2",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Dropout",
                      "config": {
                        "name": "dropout_2",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                      },
                      "name": "dropout_2",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d_3",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Concatenate",
                      "config": {
                        "name": "concatenate_2",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": -1
                      },
                      "name": "concatenate_2",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_1",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_2",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "batch_normalization_3",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                          3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "gamma_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "moving_mean_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "moving_variance_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "beta_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "gamma_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "beta_constraint": null,
                        "gamma_constraint": null
                      },
                      "name": "batch_normalization_3",
                      "inbound_nodes": [
                        [
                          [
                            "concatenate_2",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Activation",
                      "config": {
                        "name": "activation_3",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "elu"
                      },
                      "name": "activation_3",
                      "inbound_nodes": [
                        [
                          [
                            "batch_normalization_3",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d_4",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 8,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "class_name": "GlorotUniform",
                          "config": {
                            "seed": null
                          }
                        },
                        "bias_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "kernel_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "name": "conv2d_4",
                      "inbound_nodes": [
                        [
                          [
                            "activation_3",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Dropout",
                      "config": {
                        "name": "dropout_3",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                      },
                      "name": "dropout_3",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d_4",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Concatenate",
                      "config": {
                        "name": "concatenate_3",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": -1
                      },
                      "name": "concatenate_3",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_1",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_2",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_3",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "batch_normalization_4",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                          3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "gamma_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "moving_mean_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "moving_variance_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "beta_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "gamma_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "beta_constraint": null,
                        "gamma_constraint": null
                      },
                      "name": "batch_normalization_4",
                      "inbound_nodes": [
                        [
                          [
                            "concatenate_3",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Activation",
                      "config": {
                        "name": "activation_4",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "elu"
                      },
                      "name": "activation_4",
                      "inbound_nodes": [
                        [
                          [
                            "batch_normalization_4",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d_5",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 8,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "class_name": "GlorotUniform",
                          "config": {
                            "seed": null
                          }
                        },
                        "bias_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "kernel_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "name": "conv2d_5",
                      "inbound_nodes": [
                        [
                          [
                            "activation_4",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Dropout",
                      "config": {
                        "name": "dropout_4",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                      },
                      "name": "dropout_4",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d_5",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Concatenate",
                      "config": {
                        "name": "concatenate_4",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": -1
                      },
                      "name": "concatenate_4",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_1",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_2",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_3",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_4",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "batch_normalization_5",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                          3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "gamma_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "moving_mean_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "moving_variance_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "beta_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "gamma_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "beta_constraint": null,
                        "gamma_constraint": null
                      },
                      "name": "batch_normalization_5",
                      "inbound_nodes": [
                        [
                          [
                            "concatenate_4",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Activation",
                      "config": {
                        "name": "activation_5",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "elu"
                      },
                      "name": "activation_5",
                      "inbound_nodes": [
                        [
                          [
                            "batch_normalization_5",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d_6",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 8,
                        "kernel_size": [
                          3,
                          3
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                          "class_name": "GlorotUniform",
                          "config": {
                            "seed": null
                          }
                        },
                        "bias_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "kernel_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                      },
                      "name": "conv2d_6",
                      "inbound_nodes": [
                        [
                          [
                            "activation_5",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Dropout",
                      "config": {
                        "name": "dropout_5",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                      },
                      "name": "dropout_5",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d_6",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Concatenate",
                      "config": {
                        "name": "concatenate_5",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": -1
                      },
                      "name": "concatenate_5",
                      "inbound_nodes": [
                        [
                          [
                            "conv2d",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_1",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_2",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_3",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_4",
                            0,
                            0,
                            {}
                          ],
                          [
                            "dropout_5",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "BatchNormalization",
                      "config": {
                        "name": "batch_normalization_6",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                          3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "gamma_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "moving_mean_initializer": {
                          "class_name": "Zeros",
                          "config": {}
                        },
                        "moving_variance_initializer": {
                          "class_name": "Ones",
                          "config": {}
                        },
                        "beta_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "gamma_regularizer": {
                          "class_name": "L2",
                          "config": {
                            "l2": 9.999999747378752e-05
                          }
                        },
                        "beta_constraint": null,
                        "gamma_constraint": null
                      },
                      "name": "batch_normalization_6",
                      "inbound_nodes": [
                        [
                          [
                            "concatenate_5",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Activation",
                      "config": {
                        "name": "activation_6",
                        "trainable": true,
                        "dtype": "float32",
                        "activation": "elu"
                      },
                      "name": "activation_6",
                      "inbound_nodes": [
                        [
                          [
                            "batch_normalization_6",
                            0,
                            0,
                            {}
                          ]
                        ]
                      ]
                    },
                    {
                      "class_name": "Conv2D",
                      "config": {
                        "name": "conv2d_7",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 64,
                        "kernel_size": [
                          1,
                          1
                        ],
                        "strides": [
                          1,
                          1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                          1,
                          1
                        ],
